app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["content", "Test"], ["created_at", "2017-10-13 05:17:31.413054"], ["updated_at", "2017-10-13 05:17:31.413054"], ["user_id", 1]]

  def destroy
    if current_user.id == @post.user_id
      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]